offprice/class.dot
strict digraph {

  "offprice/providers/auth.dartAuthProvider" -> "flutter/src/foundation/change_notifier.dartChangeNotifier"
  "offprice/providers/products.dartProductsProvider" -> "flutter/src/foundation/change_notifier.dartChangeNotifier"
  "offprice/providers/folders.dartFoldersProvider" -> "flutter/src/foundation/change_notifier.dartChangeNotifier"
  "offprice/providers/promotions.dartPromotionsProvider" -> "flutter/src/foundation/change_notifier.dartChangeNotifier"
  "offprice/screens/all_folders.dartAllFoldersScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/all_folders.dart_AddPromotionScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/all_products.dartAllProductsScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/all_products.dart_AllProductsScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/add_promotion.dartAddPromotionScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/add_promotion.dart_AddPromotionScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/single_folder.dartSingleFolder" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/screens/all_deals.dartAllDealsScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/all_deals.dart_AllDealsScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/add_foder.dartAddFolderScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/add_foder.dart_AddFolderScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/single_product_screen.dartSingleProductScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/single_product_screen.dart_MainScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/login_screen.dartLoginScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/login_screen.dart_LoginScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/user_settings.dartUserSettingsScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/user_settings.dart_AddPromotionScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/main_screen.dartMainScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/main_screen.dart_MainScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/product_promotion.dartProductPromotionScreen" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/product_promotion.dart_ProductPromotionScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/screens/product_promotion.dartLabeledText" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/screens/add_promotion_next.dartAddPromotionNext" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/screens/add_promotion_next.dart_LoginScreenState" -> "flutter/src/widgets/framework.dartState"
  "offprice/main.dartMyApp" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/main.dartSplash" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/gradient_text.dartGradientText" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/glassmorphism_card.dartGlassmorphismCard" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/promotions_list.dartPromotionsList" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/widgets/promotions_list.dart_PromotionsListState" -> "flutter/src/widgets/framework.dartState"
  "offprice/widgets/text_field_dark.dartTextFieldDark" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/widgets/text_field_dark.dart_TextFieldDarkState" -> "flutter/src/widgets/framework.dartState"
  "offprice/widgets/products_list.dartProductsList" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/widgets/products_list.dart_ProductsListState" -> "flutter/src/widgets/framework.dartState"
  "offprice/widgets/main_screen/hot_deals.dartHotDeals" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/main_screen/chart.dartChart" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/main_screen/chart.dartCustomCircleSymbolRenderer" -> "charts_common/src/common/symbol_renderer.dartCircleSymbolRenderer"
  "offprice/widgets/main_screen/favourite_product.dartFavouriteProduct" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/main_screen/favourite_folder.dartFavouriteFolder" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/product_card.dartProductCard" -> "flutter/src/widgets/framework.dartStatelessWidget"
  "offprice/widgets/settings_button.dartSettingsButton" -> "flutter/src/widgets/framework.dartStatefulWidget"
  "offprice/widgets/settings_button.dart_SettingsButtonState" -> "flutter/src/widgets/framework.dartState"

}
